<?php 
// Радиус земли
define('EARTH_RADIUS', 6372795);
 
/*
* Расстояние между двумя точками
* $φA, $λA - широта, долгота 1-й точки,
* $φB, $λB - широта, долгота 2-й точки
* Написано по мотивам http://gis-lab.info/qa/great-circles.html
* Михаил Кобзарев <mikhail@kobzarev.com>
*
*/
function calculateTheDistance ($φA, $λA, $φB, $λB) {
 
// перевести координаты в радианы
$lat1 = $φA * M_PI / 180;
$lat2 = $φB * M_PI / 180;
$long1 = $λA * M_PI / 180;
$long2 = $λB * M_PI / 180;
 
// косинусы и синусы широт и разницы долгот
$cl1 = cos($lat1);
$cl2 = cos($lat2);
$sl1 = sin($lat1);
$sl2 = sin($lat2);
$delta = $long2 - $long1;
$cdelta = cos($delta);
$sdelta = sin($delta);
 
// вычисления длины большого круга
$y = sqrt(pow($cl2 * $sdelta, 2) + pow($cl1 * $sl2 - $sl1 * $cl2 * $cdelta, 2));
$x = $sl1 * $sl2 + $cl1 * $cl2 * $cdelta;
 
//
$ad = atan2($y, $x);
$dist = $ad * EARTH_RADIUS;
 
return $dist;
}

function switchTextToEnglish ($text)
{
    $str_search = array(
    "й","ц","у","к","е","н","г","ш","щ","з","х","ъ",
    "ф","ы","в","а","п","р","о","л","д","ж","э",
    "я","ч","с","м","и","т","ь","б","ю",

    "Й","Ц","У","К","Е","Н","Г","Ш","Щ","З","Х","Ъ",
    "Ф","Ы","В","А","П","Р","О","Л","Д","Ж","Э",
    "Я","Ч","С","М","И","Т","Ь","Б","Ю"
    );

    $str_replace = array(
    "q","w","e","r","t","y","u","i","o","p","[","]",
    "a","s","d","f","g","h","j","k","l",";","'",
    "z","x","c","v","b","n","m",",",".",

    "Q","W","E","R","T","Y","U","I","O","P","[","]",
    "A","S","D","F","G","H","J","K","L",";","'",
    "Z","X","C","V","B","N","M",",","."
    );

    return str_replace($str_search, $str_replace, $text);
}

function switchTextToRussian ($text)
{
    $str_search = array(
    "q","w","e","r","t","y","u","i","o","p","[","]",
    "a","s","d","f","g","h","j","k","l",";","'",
    "z","x","c","v","b","n","m",",",".",

    "Q","W","E","R","T","Y","U","I","O","P","[","]",
    "A","S","D","F","G","H","J","K","L",";","'",
    "Z","X","C","V","B","N","M",",","."
    );

    $str_replace = array(
    "й","ц","у","к","е","н","г","ш","щ","з","х","ъ",
    "ф","ы","в","а","п","р","о","л","д","ж","э",
    "я","ч","с","м","и","т","ь","б","ю",

    "Й","Ц","У","К","Е","Н","Г","Ш","Щ","З","Х","Ъ",
    "Ф","Ы","В","А","П","Р","О","Л","Д","Ж","Э",
    "Я","Ч","С","М","И","Т","Ь","Б","Ю"
    );

    return str_replace($str_search, $str_replace, $text);
}
?>