<?php 

 return [
    "cottage_types" => [
        "Вилла" => "Вилла",
        'Земельный_участок' => 'Участок',
        "Квадрекс" => "Квадрекс",
        "Дуплекс" =>  "Дуплекс",
        "Коттедж" => "Коттедж",
        "Таунхаус" => "Таунхаус",
        "Эллинг" => "Эллинг",
    ],
    "cottage_types_genitive" => [
        "Вилла" => "Виллы",
        'Земельный_участок' => 'Земельного участка',
        "Квадрекс" => "Квадрекса",
        "Дуплекс" =>  "Дуплекса",
        "Коттедж" => "Коттеджа",
        "Таунхаус" => "Таунхауса",
        "Эллинг" => "Эллинга",
    ],
    "cottage_types_plural" => [
        "Вилла" => "Виллы",
        'Земельный_участок' => 'Земельные участки',
        "Квадрекс" => "Квадрексы",
        "Дуплекс" =>  "Дуплексы",
        "Коттедж" => "Коттеджи",
        "Таунхаус" => "Таунхаусы",
        "Эллинг" => "Эллинги",
    ],
    "cottage_types_plural_genitive" => [
        "Вилла" => "Вилл",
        'Земельный_участок' => 'Земельных участков',
        "Квадрекс" => "Квадрексов",
        "Дуплекс" =>  "Дуплексов",
        "Коттедж" => "Коттеджей",
        "Таунхаус" => "Таунхаусов",
        "Эллинг" => "Эллингов",
    ],
    "newbuild_types" => [
        'Квартира' => 'Квартира',
        'Апартаменты' => 'Апартаменты'
    ],
    "newbuild_types_genitive" => [
        'Квартира' => 'Квартиры',
        'Апартаменты' => 'Апартаментов'
    ],
    "newbuild_types_plural" => [
        'Квартира' => 'Квартиры',
        'Апартаменты' => 'Апартаменты'
    ],
    "newbuild_types_plural_genitive" => [
        'Квартира' => 'Квартир',
        'Апартаменты' => 'Апартаментов'
    ],
    'wall_materials' => [
        1 => "кирпич",
        2 => "газобетон",
        3 => "кирпич красный",
        4 => "ракушечник",
        5 => "кирпич облицовочный",
        6 => "кирпич силикатный",
        7 => "брус",
        8 => "пенобетон",
        9 => "сайдинг",
        10 => "сэндвич-панели",
        11 => "каркасно-щитовой",
        14 => "монолитно-каркасный",
        19 => "панельный",
        20 => "монолитный",
        21 => "с утеплением",
        48 => 'газоблок',
        49 => 'керамоблок'
    ],
    'roof_materials' => [
        1 => "шифер",
        2 => "битумная черепица",
        3 => "металлочерепица",
        4 => "черепица",
        5 => "медь",
        6 => "оцынковка",
    ],
    'communications' => [
        "газ" => "газ",
        "электричество" => "электричество",
        "водоснабжение" => "водоснабжение",
        "отопление" => "отопление",
        "котел" => "котел",
        "канализация центральная" => "канализация центральная",
        "скважина" => "скважина",
        "централизованные коммуникации" => "централизованные коммуникации",
        "все автономно" => "все автономно",
        "колодец" => "колодец",
        "геотермальный насос" => "геотермальный насос",
        "септик" => "септик",
    ],
];