<?php 

return [
  'error' => 'Ошибка отправки формы. Проверьте правильность заполнения полей.',
  'errors' => [
    'required' => 'Поле обязательно для заполнения.',
    'email' => 'Неверный формат email-адреса'
  ],
  'success' => [
    'subscription' => 'Спасибо, подписка успешно оформлена',
    'research' => 'Спасибо, заявка на проведение исследования успешно отправлена',
    'application' => 'Спасибо, Вы успешно зарегистрированы',
    'review' => 'Отзыв добавлен. Ожидайте модерации.'
  ],
  'placeholders' => [
    'Напишите отзыв' => 'Напишите отзыв',
    'Как к вам обращаться?' => 'Как к вам обращаться?',
    'Ваш электронный адрес' => 'Ваш электронный адрес',
    'Номер телефона' => 'Номер телефона',
    'Опишите ключевые пункты' => 'Опишите ключевые пункты',
    'Укажите регион' => 'Укажите регион',
    'Выберите методику' => 'Выберите методику',
    'Укажите структуру и объем' => 'Укажите структуру и объем',
    'Напишите дополнительно' => 'Напишите дополнительно',
    'Название организации' => 'Название организации',
    'КГ, адрес или компания' => 'КГ, адрес или компания',
    'Название компании' => 'Название компании',
    'Введите имя' => 'Введите имя',
  ]
];