<?php 

 return [
    "newbuild_types_plural_genitive" => [
        "Квартира" => "Квартир",
        "Апартаменты" => "Апартаментів"
    ],
    "newbuild_types" => [
        "Квартира" => "Квартира",
        "Апартаменты" => "Апартаменти"
    ],
    "newbuild_types_plural" => [
        "Квартира" => "Квартири",
        "Апартаменты" => "Апартаменти"
    ],
    "newbuild_types_genitive" => [
        "Квартира" => "Квартири",
        "Апартаменты" => "Апартаментів"
    ],
    "roof_materials" => [
        1 => "шифер",
        2 => "бітумна черепиця",
        3 => "металочерепиця",
        4 => "черепиця",
        5 => "мідь",
        6 => "оцинковка"
    ],
    "cottage_types_plural_genitive" => [
        "Вилла" => "Вілл",
        "Земельный_участок" => "Земельних ділянок",
        "Квадрекс" => "Квадрексів",
        "Дуплекс" => "Дуплексів",
        "Коттедж" => "Котеджів",
        "Таунхаус" => "Таунхаусів",
        "Эллинг" => "Елінгів"
    ],
    "cottage_types" => [
        "Вилла" => "Вілла",
        "Земельный_участок" => "Ділянка",
        "Квадрекс" => "Квадрекс",
        "Дуплекс" => "Дуплекс",
        "Коттедж" => "Котедж",
        "Таунхаус" => "Таунхаус",
        "Эллинг" => "Елінг"
    ],
    "cottage_types_genitive" => [
        "Вилла" => "Вілли",
        "Земельный_участок" => "Земельної ділянки",
        "Квадрекс" => "Квадрексу",
        "Дуплекс" => "Дуплексу",
        "Коттедж" => "Котеджу",
        "Таунхаус" => "Таунхаусу",
        "Эллинг" => "Елінгу"
    ],
    "cottage_types_plural" => [
        "Вилла" => "Вілли",
        "Земельный_участок" => "Земельні ділянки",
        "Квадрекс" => "Квадрекси",
        "Дуплекс" => "Дуплекси",
        "Коттедж" => "Котеджі",
        "Таунхаус" => "Таунхауси",
        "Эллинг" => "Елінги"
    ],
    "communications" => [
        "газ" => "газ",
        "электричество" => "електрика",
        "водоснабжение" => "водопостачання",
        "отопление" => "опалення",
        "котел" => "котел",
        "канализация_центральная" => "каналізація центральна",
        "скважина" => "свердловина",
        "централизованные_коммуникации" => "централізовані комунікації",
        "все_автономно" => "усе автономно",
        "колодец" => "колодязь",
        "геотермальный_насос" => "геотермальний насос",
        "септик" => "септик"
    ],
    "wall_materials" => [
        1 => "цегла",
        2 => "газобетон",
        3 => "цегла червона",
        4 => "ракушняк",
        5 => "цегла лицювальна",
        6 => "цегла силікатна",
        7 => "брус",
        8 => "пінобетон",
        9 => "сайдинг",
        10 => "сендвіч-панелі",
        11 => "каркасно-щитовий",
        14 => "монолітно-каркасний",
        19 => "панельний",
        20 => "монолітний",
        21 => "з утепленням",
        48 => "газоблок",
        49 => "керамоблок"
    ]
];