<?php 

 return [
    "error" => "Помилка відправки форми. Перевірте правильність заповнення полів.",
    "success" => [
        "subscription" => "Спасибі, підписка успішно оформлена",
        "research" => "Спасибі, заявка на проведення дослідження успішно відправлена",
		'review' => 'Відгук доданий. Чекайте модерації.'
    ],
    "errors" => [
        "required" => "Поле обов'язкове для заповнення.",
        "email" => "Невірний формат email-адреси"
    ],
    "placeholders" => [
        "Напишите_отзыв" => "Залиште будь-ласка відгук",
        "Как_к_вам_обращаться?" => "Як до вас звертатись?",
        "Ваш_электронный_адрес" => "Ваша електронна адреса",
        "Номер_телефона" => "Номер телефону",
        "Опишите_ключевые_пункты" => "Опишіть ключові пункти",
        "Укажите_регион" => "Вкажіть регіон",
        "Выберите_методику" => "Виберіть методику",
        "Укажите_структуру_и_объем" => "Вкажіть структуру та обсяг",
        "Напишите_дополнительно" => "Напишіть додатково",
        "Название_организации" => "Назва організації",
        "КГ,_адрес_или_компания" => "КМ, адреса або компанія",
        "Название_компании" => "Назва компанії",
        "Введите_имя" => "Введіть ім'я"
    ]
];