<?php 

 return [
    "nominative" => [
        "Вилла" => "Вілли",
        "Участок" => "Ділянки",
        "Квадрекс" => "Квадрекси",
        "Дуплекс" => "Дуплекси",
        "Коттедж" => "Котеджі",
        "Таунхаус" => "Таунхауси",
        "Эллинг" => "Елінги",
        "Земельный_участок" => "Земельні ділянки",
        1 => "1-к квартири",
        2 => "2-к квартири",
        3 => "3-к квартири",
        4 => "4-к квартири",
        5 => "5-к квартири",
        6 => "6-к квартири",
        "Квартира" => "Квартири",
        "Апартаменты" => "Апартаменти"
    ],
    "genitive" => [
        "Вилла" => "вілл",
        "Участок" => "ділянок",
        "Квадрекс" => "квадрексів",
        "Дуплекс" => "дуплексів",
        "Коттедж" => "котеджів",
        "Таунхаус" => "таунхаусів",
        "Эллинг" => "елінгів",
        "Земельный_участок" => "земельних ділянок",
        1 => "1-к квартир",
        2 => "2-к квартир",
        3 => "3-к квартир",
        4 => "4-к квартир",
        5 => "5-к квартир",
        6 => "6-к квартир",
        "Квартира" => "Квартир",
        "Апартаменты" => "Апартаментів"
    ],
    "prepositional" => [
        "Вилла" => "віллах",
        "Участок" => "ділянках",
        "Квадрекс" => "квадрексах",
        "Дуплекс" => "дуплексах",
        "Коттедж" => "котеджах",
        "Таунхаус" => "таунхаусах",
        "Эллинг" => "елінгах",
        "Земельный_участок" => "земельних ділянках",
        1 => "1-к квартирах",
        2 => "2-к квартирах",
        3 => "3-к квартирах",
        4 => "4-к квартирах",
        5 => "5-к квартирах",
        6 => "6-к квартирах",
        "Квартира" => "Квартирах",
        "Апартаменты" => "Апартаментах"
    ]
];